In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df=pd.read_csv("train.csv")

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# Group By

1. How many passengers survived, grouped by passenger class (Pclass)?

In [4]:
df.groupby(['Pclass','Survived']).size().reset_index(name='Passenger_Count')

   Pclass  Survived  Passenger_Count
0       1         0               80
1       1         1              136
2       2         0               97
3       2         1               87
4       3         0              372
5       3         1              119

<p> _____________________________________</p>

2. What is the average age of passengers, grouped by survival status (Survived)?

In [5]:
df.groupby('Survived')['Age'].mean().reset_index(name="avg_age")

   Survived    avg_age
0         0  30.626179
1         1  28.343690

<p> _____________________________________</p>

3. What is the total fare collected from each embarkation point (Embarked)?

In [6]:
df.groupby('Embarked')['Fare'].sum().reset_index(name='Total fare')

  Embarked  Total fare
0        C  10072.2962
1        Q   1022.2543
2        S  17439.3988

<p> _____________________________________</p>

4. How many male and female passengers were there, grouped by passenger class (Pclass)?

In [7]:
df.groupby(['Pclass','Sex']).size().reset_index(name="passenger count")

   Pclass     Sex  passenger count
0       1  female               94
1       1    male              122
2       2  female               76
3       2    male              108
4       3  female              144
5       3    male              347

<p> ________________________________________</p>

5. What is the average fare paid by passengers, grouped by the number of siblings/spouses aboard (SibSp)?

In [10]:
df.groupby('SibSp')['Fare'].mean()

SibSp
0    25.692028
1    44.147370
2    51.753718
3    68.908862
4    31.855556
5    46.900000
8    69.550000
Name: Fare, dtype: float64

<p> __________________________________</p>

6. How many passengers survived, grouped by their embarkation port (Embarked)?

In [16]:
df.groupby(['Survived','Embarked']).size().reset_index(name="Total Survived")

   Survived       Embarked  Total Survived
0         0              C              75
1         0              Q              47
2         0              S             427
3         1              C              93
4         1              Q              30
5         1              S             217
6         1  most_frequent               2

<p> _____________________________________</p>

7. What is the average age of passengers, grouped by sex and survival status?

In [17]:
df.groupby(['Sex','Survived'])['Age'].mean()

Sex     Survived
female  0           25.046875
        1           28.847716
male    0           31.618056
        1           27.276022
Name: Age, dtype: float64

<p> ____________________________</p>

8. How many passengers survived, grouped by the number of parents/children aboard (Parch)?

In [19]:
df.groupby(['Survived','Parch']).size().reset_index(name="Survived rate")

    Survived  Parch  Survived rate
0          0      0            445
1          0      1             53
2          0      2             40
3          0      3              2
4          0      4              4
5          0      5              4
6          0      6              1
7          1      0            233
8          1      1             65
9          1      2             40
10         1      3              3
11         1      5              1

<p> _______________________________</p>

9. What is the total fare paid by each combination of Pclass and survival status (Survived)?

In [20]:
df.groupby(['Survived',"Pclass"])['Fare'].sum()

Survived  Pclass
0         1          5174.7206
          2          1882.9958
          3          5085.0035
1         1         13002.6919
          2          1918.8459
          3          1629.6916
Name: Fare, dtype: float64

<p> _______________________________ </p>

10. How many passengers are in each age group, grouped by passenger class (Pclass)?

In [23]:
# Create an 'AgeGroup' column by binning the 'Age' into categories
df['AgeGroup'] = pd.cut(df['Age'], bins=[0, 18, 50, 100], labels=['under 18', '18-50', 'over 50'])

# Group by 'Pclass' and 'AgeGroup' and count the number of passengers in each group
passengers_by_age_group_pclass = df.groupby(['Pclass', 'AgeGroup'])['PassengerId'].count()

# Display the result
print(passengers_by_age_group_pclass)

Pclass  AgeGroup
1       under 18     16
        18-50       131
        over 50      39
2       under 18     29
        18-50       129
        over 50      15
3       under 18     94
        18-50       251
        over 50      10
Name: PassengerId, dtype: int64

<p> _______________________________ </p>

# Crosstab

1. What is the survival rate of passengers, based on their sex and passenger class (Pclass)?

In [8]:
np.round(pd.crosstab(df['Survived'],df['Pclass'],normalize='columns')*100,0)

Pclass       1     2     3
Survived
0         37.0  53.0  76.0
1         63.0  47.0  24.0

<p> ______________________________________</p>

2. How does the number of passengers who survived vary by their embarkation port (Embarked) and passenger class (Pclass)?

In [11]:
np.round(pd.crosstab(df['Survived'],df['Embarked'],normalize='columns')*100,0)

Embarked     C     Q     S
Survived
0         45.0  61.0  66.0
1         55.0  39.0  34.0

<p> _______________________________________</p>

3. How many passengers survived, broken down by their number of siblings/spouses aboard (SibSp) and their sex?

In [16]:
pd.crosstab(df['SibSp'],df['Sex'],df['Survived'],aggfunc='sum')

Sex    female  male
SibSp
0         137    73
1          80    32
2          10     3
3           4     0
4           2     1
5           0     0
8           0     0

<p> _______________________________ </p>

4. What is the survival rate based on the number of parents/children aboard (Parch) and the class of the ticket (Pclass)?

In [5]:
pd.crosstab(df['Parch'],df['Pclass'],df['Survived'],aggfunc='mean')

Pclass         1         2         3
Parch
0       0.607362  0.358209  0.225722
1       0.677419  0.750000  0.363636
2       0.761905  0.812500  0.255814
3            NaN  1.000000  0.333333
4       0.000000       NaN  0.000000
5            NaN       NaN  0.200000
6            NaN       NaN  0.000000

<p> _________________________________________ </p>

5. How many passengers survived, crosstabbed by their age group (e.g., under 18, 18-50, over 50) and sex?

In [6]:
# Create an 'AgeGroup' column
df['AgeGroup'] = pd.cut(df['Age'], bins=[0, 18, 50, 100], labels=['under 18', '18-50', 'over 50'])

# Create a crosstab for the number of survivors by 'AgeGroup' and 'Sex'
survived_agegroup_sex = pd.crosstab(df['AgeGroup'], df['Sex'], df['Survived'], aggfunc='sum')

# Display the result
print(survived_agegroup_sex)

Sex       female  male
AgeGroup
under 18      46    24
18-50        135    63
over 50       16     6

<p> ________________________________ </p>

6. How many passengers survived, crosstabbed by their ticket class (Pclass) and embarkation port (Embarked)?

In [7]:
# Create a crosstab for the number of survivors by 'Pclass' and 'Embarked'
survived_pclass_embarked = pd.crosstab(df['Pclass'], df['Embarked'], df['Survived'], aggfunc='sum')

# Display the result
print(survived_pclass_embarked)

Embarked   C   Q   S
Pclass
1         59   1  74
2          9   2  76
3         25  27  67

<p> _____________________________ </p>

7. How does the survival count vary by age group and the number of siblings/spouses aboard (SibSp)?

In [8]:
# Create a crosstab for the number of survivors by 'AgeGroup' and 'SibSp'
survived_agegroup_sibsp = pd.crosstab(df['AgeGroup'], df['SibSp'], df['Survived'], aggfunc='sum')

# Display the result
print(survived_agegroup_sibsp)

SibSp       0   1  2  3  4  5  8
AgeGroup
under 18   35  26  6  0  3  0  0
18-50     128  62  4  4  0  0  0
over 50    12   9  1  0  0  0  0

<p> ____________________________ </p>

8. What is the survival rate of passengers, crosstabbed by their sex and the number of parents/children aboard (Parch)?

In [9]:
# Create a crosstab to calculate the survival rate by 'Sex' and 'Parch'
survival_rate_sex_parch = pd.crosstab(df['Sex'], df['Parch'], df['Survived'], aggfunc='mean')

# Display the result
print(survival_rate_sex_parch)

Parch          0         1         2     3    4     5    6
Sex
female  0.788660  0.766667  0.612245  0.75  0.0  0.25  0.0
male    0.165289  0.327586  0.322581  0.00  0.0  0.00  NaN

<p> _________________________________ </p>

9. How many passengers survived, crosstabbed by their embarkation port (Embarked) and survival status (Survived)?

In [10]:
# Create a crosstab for the number of survivors by 'Embarked' and 'Survived'
survived_embarked_status = pd.crosstab(df['Embarked'], df['Survived'])

# Display the result
print(survived_embarked_status)

Survived    0    1
Embarked
C          75   93
Q          47   30
S         427  217

<p> _______________________ </p>

10. How many passengers embarked at each port (Embarked), crosstabbed by their sex and passenger class (Pclass)?

In [11]:
# Create a crosstab for the number of passengers by 'Embarked', 'Sex', and 'Pclass'
embarked_sex_pclass = pd.crosstab(df['Embarked'], [df['Sex'], df['Pclass']])

# Display the result
print(embarked_sex_pclass)

Sex      female         male
Pclass        1   2   3    1   2    3
Embarked
C            43   7  23   42  10   43
Q             1   2  33    1   1   39
S            48  67  88   79  97  265

<p> ____________________________ </p>

# Pivot Tabel

1. Create a pivot table showing the average fare paid, grouped by passenger class (Pclass) and survival status (Survived).

In [12]:
# Create the pivot table
pivot_avg_fare = pd.pivot_table(df, values='Fare', index='Pclass', columns='Survived', aggfunc='mean')

# Display the result
print(pivot_avg_fare)

Survived          0          1
Pclass
1         64.684007  95.608029
2         19.412328  22.055700
3         13.669364  13.694887

<p> __________________________ </p>

2. Create a pivot table showing the count of passengers by embarkation port (Embarked) and survival status (Survived).

In [13]:
# Create the pivot table
pivot_count_passengers = pd.pivot_table(df, values='PassengerId', index='Embarked', columns='Survived', aggfunc='count')

# Display the result
print(pivot_count_passengers)

Survived    0    1
Embarked
C          75   93
Q          47   30
S         427  217

<p> __________________________ </p>

3. Create a pivot table showing the average age of passengers, grouped by sex and passenger class (Pclass).

In [14]:
# Create the pivot table
pivot_avg_age = pd.pivot_table(df, values='Age', index='Sex', columns='Pclass', aggfunc='mean')

# Display the result
print(pivot_avg_age)

Pclass          1          2          3
Sex
female  34.611765  28.722973  21.750000
male    41.281386  30.740707  26.507589

<p> _____________________________ </p>

4. Create a pivot table showing the total fare paid by passengers, grouped by the number of siblings/spouses aboard (SibSp) and their survival status (Survived).

In [15]:
# Create the pivot table
pivot_total_fare = pd.pivot_table(df, values='Fare', index='SibSp', columns='Survived', aggfunc='sum')

# Display the result
print(pivot_total_fare)

Survived          0          1
SibSp
0         6611.6071  9009.1459
1         3256.1710  5970.6294
2          511.2000   937.9041
3          539.6918   562.8500
4          502.7000    70.7000
5          234.5000        NaN
8          486.8500        NaN

<p> ___________________________ </p>

5. Create a pivot table showing the count of passengers, grouped by their passenger class (Pclass) and sex.

In [16]:
# Create the pivot table
pivot_count_passengers_class_sex = pd.pivot_table(df, values='PassengerId', index='Pclass', columns='Sex', aggfunc='count')

# Display the result
print(pivot_count_passengers_class_sex)

Sex     female  male
Pclass
1           94   122
2           76   108
3          144   347

<p> ________________________ </p>

6. Create a pivot table showing the average fare paid, grouped by the number of parents/children aboard (Parch) and survival status (Survived).

In [17]:
# Create the pivot table
pivot_avg_fare_parch = pd.pivot_table(df, values='Fare', index='Parch', columns='Survived', aggfunc='mean')

# Display the result
print(pivot_avg_fare_parch)

Survived          0          1
Parch
0         16.548124  42.849430
1         37.111642  54.660126
2         55.625000  73.050207
3         34.375000  20.336100
4         84.968750        NaN
5         32.840625  31.387500
6         46.900000        NaN

<p> ______________________________ </p>

7. Create a pivot table showing the total count of passengers who embarked from each port (Embarked), grouped by survival status (Survived) and sex.

In [18]:
# Create the pivot table
pivot_count_embarked_sex = pd.pivot_table(df, values='PassengerId', index='Embarked', columns=['Survived', 'Sex'], aggfunc='count')

# Display the result
print(pivot_count_embarked_sex)

Survived      0           1
Sex      female male female male
Embarked
C             9   66     64   29
Q             9   38     27    3
S            63  364    140   77

<p> ____________________________ </p>

8. Create a pivot table showing the survival count by passenger class (Pclass) and the number of siblings/spouses aboard (SibSp).

In [19]:
# Create the pivot table
pivot_survival_sibsp_pclass = pd.pivot_table(df, values='PassengerId', index='Pclass', columns='SibSp', aggfunc='count')

# Display the result
print(pivot_survival_sibsp_pclass)

SibSp       0     1     2     3     4    5    8
Pclass
1       137.0  71.0   5.0   3.0   NaN  NaN  NaN
2       120.0  55.0   8.0   1.0   NaN  NaN  NaN
3       351.0  83.0  15.0  12.0  18.0  5.0  7.0

<p> ________________________ </p>

9. Create a pivot table showing the average age of passengers, grouped by the number of parents/children aboard (Parch) and the class of their ticket (Pclass).

In [20]:
# Create the pivot table
pivot_avg_age_parch_pclass = pd.pivot_table(df, values='Age', index='Parch', columns='Pclass', aggfunc='mean')

# Display the result
print(pivot_avg_age_parch_pclass)

Pclass          1          2          3
Parch
0       39.906716  33.081301  27.835227
1       41.266667  21.796875  15.644167
2       21.996190  20.270625  12.403226
3             NaN  39.000000  29.333333
4       64.000000        NaN  38.000000
5             NaN        NaN  39.200000
6             NaN        NaN  43.000000

<p> ____________________________ </p>

10. Create a pivot table showing the count of passengers, grouped by their age group (e.g., under 18, 18-50, over 50) and survival status (Survived).

In [21]:
# Create an 'AgeGroup' column
df['AgeGroup'] = pd.cut(df['Age'], bins=[0, 18, 50, 100], labels=['under 18', '18-50', 'over 50'])

# Create the pivot table
pivot_count_agegroup_survived = pd.pivot_table(df, values='PassengerId', index='AgeGroup', columns='Survived', aggfunc='count')

# Display the result
print(pivot_count_agegroup_survived)

Survived    0    1
AgeGroup
under 18   69   70
18-50     313  198
over 50    42   22